Repository: BillmanL/iOSDemoApp
Catalog: LinnarBillmanDemo/Assets/Localization/Localizable.xcstrings
Source language: en
Languages: sv

# Error.GeneralError
source: Something went wrong
sv: Något gick fel

# Movie.Detail.Button.Text
source: Go to IMDB page
sv: Gå till IMDB-sida

# MovieDetailsView.Plot
source: Plot:
sv: Handling:

# MovieDetailsView.Rating
source: Rating:
sv: Betyg:

# StartView.Body1
source: Simple: I believe SwiftUI is the future. It’s also much more fun! If you additionally pair it with Combine you have the possibility to build a very powerful reactive app.
sv: Enkelt: Jag tror på att SwiftUI är framtiden. Dessutom är det mycket roligare att bygga! Om du dessutom kombinerar det med Combine har du möjlighet att bygga en väldigt kraftfull reaktiv app.

# StartView.Body2
source: I have limited experience with CoreData and SwiftData. After reading up on it a bit i realized i would need more time to learn best practices and how to use them efficiently. I also found that for the limited requirements of this app, UserDefaults might be preferable due to less overhead and implementation speed.
sv: Jag har begränsad erfarenhet av CoreData och SwiftData. Efter att ha läst på lite insåg jag att jag skulle behöva mer tid för att lära mig best practices samt att använda det effektivt. Jag ansåg dessutom att de begränsade kraven på appen gjorde att UserDefaults var att föredra. Detta på grund av att det har mindre overhead och går snabbare att implementera.

# StartView.Description
source: This is my demo app. I chose to implement two APIs from Dummy API: movies and users. Click the buttons below to go to each list of models. I have also described some of my implementation decisions below.
sv: Detta är min demoapp. Jag valde att implementera två APIer från Dummy API: movies och users. Klicka på knapparna nedan för att gå till varje lista av typer. Nedan beskriver jag även lite kort varför jag valde vissa implementationsdetaljer.

# StartView.MoviesButton.Title
source: Movies
sv: Filmer

# StartView.Title
source: Welcome
sv: Välkommen

# StartView.UsersButton.Title
source: Users
sv: Användare
